Revit 2026 API

# PartUtilsCreateParts(Document, ICollectionLinkElementId) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void CreateParts(
	Document document,
	ICollection<LinkElementId> hostOrLinkElementIds
)
```
```vb
Public Shared Sub CreateParts (
	document As Document,
	hostOrLinkElementIds As ICollection(Of LinkElementId)
)
```
```cpp
public:
static void CreateParts(
	Document^ document,
	ICollection<LinkElementId^>^ hostOrLinkElementIds
)
```
```fsharp
static member CreateParts :
        document : Document *
        hostOrLinkElementIds : ICollection<LinkElementId> -> unit
```

#### Parameters

document Document

hostOrLinkElementIds ICollectionLinkElementId

#### Reference

PartUtils Class

CreateParts Overload

Autodesk.Revit.DB Namespace